#в файле содержатся необходимые константы для работы с телеграмм ботом

#токен телеграмм бота
TOKEN = "5641380685:AAG_rcPmcXamW3drJXNdjJxM9Bm4OddRGjo"

#словари для работы с валютами
values={
    'доллар': 'USD',
    'евро': 'EUR',
    'рубль': 'RUB',
    'тенге': 'KZT',
    'шекель': 'ILS',
    'лари': 'GEL',
    'лира': 'TRY',
    'крона': 'CZK',
}

#для комманды values
s='Доступные валюты:'
for key in sorted(values.keys()):
    s=s+'\n'+key
values['вывод']=s

values_plural={
    'доллар': 'долларов',
    'евро': 'евро',
    'рубль': 'рублей',
    'тенге': 'тенге',
    'шекель': 'шекелей',
    'лари': 'лари',
    'лира': 'лир',
    'крона': 'крон'
}

#ключ авторизации для работы с api, из которого мы получаем курс валют
api_key = '1m0FK4Q5hyKqpOKxIMU8MUvY58nKIpZb'
